YII/advanced/frontend/views/user/view.php

SELECT * FROM `curso` WHERE `id`=1
---

    <?= DetailView::widget([
        'model' => $model,
        'attributes' => [
            //'id',
            'username',
            'email:email',
            [
              'attribute' => 'id_curso',
              'value' => $model->curso->nome,
            ],

           'created_at:datetime'
          //  [
          //    'attribute' => 'Número de usuários',
          //    'value' => User::find()->where('id_curso=1')->count();
          //  ],
            // [
            //   'attribute' => 'created_at',
            //   'value' => $data,
            // ],
        //    'data'
        ],